In [1]:
import pandas as pd
import numpy as np

data ={'eng':[10,30,50,70],
      'kor':[20,40,60,80],
      'math':[90,50,20,70]}
df = pd.DataFrame(data, index=['a','b','c','d'])
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70

In [8]:
# df[0] -> error
# df['컬럼명'] -> 시리즈로 결과 출력
# df['eng'].sum()
df['eng']

a    10
b    30
c    50
d    70
Name: eng, dtype: int64

In [5]:
df.eng 
# df['eng']과 결과는 동일하지만 컬럼명이 인덱스명과 겹칠 수가 있기 때문에 지양한다.

a    10
b    30
c    50
d    70
Name: eng, dtype: int64

In [7]:
# 복수계 컬럼식 -> 데이터프레임으로 결과 출력
df[['eng','math']]

   eng  math
a   10    90
b   30    50
c   50    20
d   70    70

In [9]:
df[['eng']]

   eng
a   10
b   30
c   50
d   70

In [10]:
#데이터프레임 슬라이싱(row(index)기준)
df[0:3]

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20

In [11]:
df['a':'c']

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20

In [13]:
# 제로베이스 인덱스
df.iloc[0]

eng     10
kor     20
math    90
Name: a, dtype: int64

In [14]:
# df.iloc[인덱스, 컬럼] 
# 컬럼:제로베이스
df.iloc[0,0]

10

In [15]:
df.iloc[1:]

   eng  kor  math
b   30   40    50
c   50   60    20
d   70   80    70

In [17]:
# 컬럼도 슬라이싱 가능
df.iloc[1:,1:]

   kor  math
b   40    50
c   60    20
d   80    70

In [19]:
df.iloc[[0,2,3]]

   eng  kor  math
a   10   20    90
c   50   60    20
d   70   80    70

In [20]:
# 컬럼도 복수계
df.iloc[[0,2,3],[0,2]]

   eng  math
a   10    90
c   50    20
d   70    70

In [21]:
# df.loc[부여된 인덱스, 부여된 컬럼]
df.loc['a']

eng     10
kor     20
math    90
Name: a, dtype: int64

In [22]:
df.loc['b':]

   eng  kor  math
b   30   40    50
c   50   60    20
d   70   80    70

In [23]:
df.loc['a','eng']

10

In [24]:
df.loc['b':, 'kor':]

   kor  math
b   40    50
c   60    20
d   80    70

In [25]:
df.loc[['a','b']]

   eng  kor  math
a   10   20    90
b   30   40    50

In [26]:
df.loc[['a','b'],['eng','math']]

   eng  math
a   10    90
b   30    50

In [28]:
# 컬럼 선택은 df.loc[:,'eng'] 이렇게 사용해야하므로 df['eng'] 선호
# 슬리아싱은 loc, iloc을 쓰는 것이 가속성에 좋다.
df['eng']

a    10
b    30
c    50
d    70
Name: eng, dtype: int64